["\nTodayit's been 13 months since I've been living in the States. I've been called a Nazi, asked if we have electricity in Germany, and been made fun of the way I speak with my German accent\", the list goes on. I'm not even German, I'm Danish. FML\n",
"\nTodayI was trying to see how far I could get away from the toilet while pissing. Instead I tripped over backwards and pissed all over my face. FML\n",
"\nTodayI busted my ass to help this old lady move her stuff because she was going to a nursing home. I was told I would get paid. When I finished four hours later the lady took me to a room and told me to pick out anything in her little goody bag. I got a race car as payment. FML\n",
"\nTodayI had a job interview at a café. The interviewer asked me my availability and I told her that I was fully flexible. She laughed and said, Really? That's tragic.\" FML\n",
"\nTodayI went to a new bar downtown with some friends. I was a little buzzed and had to pee so bad. I rushed into the bathroom and as I sat down I felt a squish on my upper thigh. Turns out the last person in the stall decided to take a shit on the toilet seat. FML",
"\nTodayI found out that I was pregnant and sent a picture of the positive test to my boyfriend. Before I got a text back from him, I got his newly updated Facebook status that read This has got to be the most depressing day of my life.\" FML\n",
"\nTodaymy best friend actually had the audacity to try and one-up my suicide attempt story. FML\n",
"\nTodayI was at a party and we were all playing Seven Minutes in Heaven. It was my crush's turn to spin the bottle so my heart started pounding. The bottle pointed towards me! Then my crush said, With her it'd be 'Seven Minutes in Hell'. Just skip me.\" FML\n",
"\nTodaymy wedding ring came off in a Walmart bathroom and fell into the toilet. It was an automatic toilet. It flushed. FML\n",
"\nTodayI woke up from a nap on my new bed to see my phone lit up with new texts. My friend sent out Wanna test out my new bed?\" as a mass text while I was asleep to every boy in my phone. Mark will be here in an hour, Jon wants to know what I'm wearing, and my ex's new girlfriend is not amused. FML\n",
"\nTodaywhile at work at a new job, my brother comes and takes my car. Along with all my money, my phone, and whatever else I had in my purse. His message to me through one of my co-workers was walk home.\" FML\n",
"\nTodayI was performing in the musical 'Cabaret'. I was playing a Nazi soldier, swastika armband and all. Someone thought it would be funny to take my real clothes while I was on stage. I had to walk a mile back my house with my costume on. Someone threw eggs at me. FML\n",
"\nTodayI went on a date with a seemingly nice guy I met online. He was drunk when I got there. Within the first 10 minutes, he had told me I was like Hitler but with boobs\", and I was \"offensive to the ninja community.\" Then he said I just wasn't all he had hoped for and left. FML\n",
"\nIt's not?Todaymy boyfriend told me he always thought the female orgasm was an urban legend. FML ",
"\nTodayI went out with a girl who I really love. We arrived to her house and before she got out of the car, I attempted to kiss her as planned. Still drunk, I grabbed her head and twisted it when I kissed her. She's now wearing a neck brace. Real smooth. FML\n",
"\n* facepalm *\nTodayfive hours into my shift, I found out that I had been given the day off. They just forgot to tell me. FML\n",
"TodayI was sitting beside a very cute girl on a 3 hour bus trip with my class. She fell asleep, head on my lap. She woke up because my erection was jabbing her in the cheek. FML ",
"\nTodayI was visiting my friend's new house and he was showing me around. I saw a small door in the wall and decided to open it. When I opened it, his daughter was hiding in there and screamed to scare me. Now I know my scream is more high pitched than his daughter's. I'm a 37 year old male. FML\n",
"\nTodayI called my husband during my lunch to tell him that I wanted to go out tonight for my birthday. We got in argument because he said we couldn't afford it. When I got home from work, he was gone, so I called his cell to see where he went. Answer: to the bar with his friends. FML\n",
"\nTodaymy entire extended family was over for Christmas. I opened a gift to see that it was a fruitcake and saw everyone looking at me, smiling. This is their way to tell me that they know I'm gay and that they accept me. I'm straight. FML\n",
"\nThe scientific methodTodaymy boyfriend thought he could make a pregnancy test read positive by jizzing on it. FML ",
"\nThreesome\nTodaymy girlfriend asked me what I wanted for my birthday. Apparently “A threesome” is not the appropriate answer. FML\n",
"\nTodaymy dad knocked me down the steps while chasing my brother around the house shouting, Get back here you pervert!\" at the top of his lungs. I have a concussion and a vertebrae fracture because my dad is a religious nutjob and he caught my 22-year-old brother having premarital sex. FML\n",
"\nTodaysomeone sent my boss a CD full of documents for an upcoming trial. It's my job to sort through the evidence, so he gave it to me. I looked on the CD. There's only one file; a 1020-page PDF of all the documents we need, and the pages weren't scanned in order. FML\n",
"\nAAARGH\nTodayI woke up sweating and gasping for air after having a terrible nightmare. The nightmare involved my deceased mother-in-law bitching me out for being a bad influence on her daughter and threatening to cut my nuts off. Even in death, she won't leave me be. FML\n",
"\nTodayI caught my half-sister stealing money from her mother's purse. Rather than risk getting in trouble, she told her uber-conservative mother that I've been seeing a girl. So now, I'm grounded for being gay, and she gets off the hook for stealing because she outed me. FML\n",
"Todaymy boyfriend told me I was selfish for choosing\" to start my period on his day off from work. FML ",
"\nAre you sure?\nTodayafter a long therapy session, in which I poured out all my feelings of how happy and in love I am with whom I believe to be my soul-mate, my shrink asked me if I was sure this guy wasn't a figment of my imagination. FML\n",
"\nTodayI decided to smoke a cigarette while I was driving to work. I was also eating french fries during the drive. I had never realized how much a cigarette feels like a french fry. In conclusion, cigarettes don't taste very good when you bite into them. FML\n",
"\nTodayI was applying some Icy Hot to my sore thighs, when I accidentally got a little on my dime sacks. For the next hour, it felt like someone had lit a match under my plums. FML\n",
"\nTodayI was working at a day care center. A 5 year old boy came up to me telling me he wanted to eat my face. Confused, I asked him why. He said, Because your face looks like pizza.\" FML\n",
"TodayI jokingly asked my husband if he had ever cheated on me. In the most sincere and honest tone, he said if I ever have or ever will, there's no way you would ever find out. I love you too much to lose you\", and gave me a hug. FML ",
"\nTodayI am so shy and friendless that my mother is literally setting up a play-date with one of her friend's daughters. I'm 25 years old and this is my best chance at making a friend. FML\n",
"\nTodayI woke up hungover and with $13 stuffed in my bra. I'm not a stripper, and I'm not sure how it got there, but that's the most money I've had on me in weeks. FML\n",
"\nTodaywhile I was on the floor stocking a bottom shelf, a man walked up behind me and humped the back of my head. He ran away laughing. This kind of shit happens all the time. I hate my job. FML\n",
"\nTodayI was driving in a busy area looking for a place to park. I happened to lock eyes with a really handsome man who was walking alongside the road. He approached my car with a huge, gorgeous smile, and as I rolled my window down he asked, Are you my Uber?\" FML\n",
"\nTodayI was taking a group shot with my friends when I asked a stranger to take the picture for us. He backed up and told us to squish closer together, and when he was at least 20 feet away, he turned and ran off with my camera. FML\n",
"\nTodaymy two favorite things in the world are Pizza and Beer... I now discover I have Celiac and can't have either. FML\n",
"\nTodayI come home to find that my dog has taken a dump on my bed. I quickly put on my house shoes to avoid possibly stepping on any other of his turds. I felt something squish all over my right foot. He also took a dump in my house shoe. FML",
"\nTodayI was hit by a car. I called my girlfriend from the hospital and asked her if she could pick me up. She responded by saying Fuck you, you aways tell me what to do!\" and hung up. FML\n",
"\nHappy Holidays!\nTodayeveryone from my job showed up for work because our boss demanded that we have a team meeting before half of the company leaves for the holidays. Everyone showed up except my boss, who is apparently already in Hawaii vacationing until New Year's. FML\n",
"\nTodayI had one more gift to buy: a copy of Fight Club. I asked a person working at Best Buy if they had any in stock. The man wouldn't sell me the last copy because I had broken the first two rules. FML\n",
"\nTodayI was in class. I am an older student going back for my PhD. I was kicked out of class for sassing\" my instructor for telling him he was wrong about what took place at an event I was actually present at. My instructor is a 22 year old TA. FML\n",
"\nTodaymy boyfriend wrecked our car. Now I can't get to work in order to make the money we need to buy a new one. FML\n",
"\nTodayI got a call that my custom order bridesmaid dress is at the apartment complex I just moved out of. They won’t give it to me because I’m no longer a resident, but they just thought I should know. The wedding’s tomorrow. FML\n",
"\nCompassion? Pah!\nTodaymy boyfriend woke up to me crying. He asked what was wrong, but before I could answer, he'd already rolled over and started snoring louder than ever, making the migraine I was crying about even worse. FML\n",
"TodayI was taking a table's order. After I finished, the guy told me, Just FYI, I'm not a tipper.\" Trying to lighten up the situation, I replied, \"It's amazing how many people forget I handle their food.\" He complained to the manager that I'd threatened him. FML ",
"\nTodayI spilt a very hot cup of tea all over a burn I got yesterday from spilling a very hot cup of tea. FML\n",
"TodayI was doing laundry while my boyfriend was sitting at the table playing on his phone. I glanced over and caught him watching my ass as I put clothes in the dryer. Trying to be sexy, I looked at him as I slowly bent over to put more clothes in. Instead, I hit my head hard on the dryer door. FML ",
"\nTodayfor the first time I sat next to a hot babe. I was feeling nervous, nevertheless, I managed to shyly ask her phone number. It’s only when I arrived back home that I realized there was a digit missing. FML\n",
"\nTodayI gave my girlfriend a new TV as a 10th anniversary present. She gave me a torch on a keyring. FML\n",
"\nTodaymy wife and I had our brand new king-size mattress set delivered. After the delivery men left, she informed me that I was no longer allowed to eat or drink in bed. Oh yeah, and we're not having sex on it either. FML\n",
"\nTodayI realized my acne looks like star constellations. I've already found the Little Dipper on my left cheek. FML\n",
"TodayI lost my virginity to my long time boyfriend and found out I'm severely allergic to latex. I also found out that my family doctor had been transferred to the ER. He went to play golf with my dad later. FML ",
"\nTodayafter watching an episode of New Girl, my boyfriend became obsessed with the Cotton-eyed Joe\" song. He won't stop playing it. FML\n",
"\nTodaymy garage was flooded. Everything was ruined. My garage also happens to be my study, in which my entire art coursework was drying. My exam is tomorrow and all I have to hand in is a pile of mushy paper. FML\n",
"TodayI played Taboo with my boyfriend and my conservative family. It was my boyfriend's turn and his word was cherry\". His only clue to me was, \"I popped your...\" He was the only one who found it funny. FML ",
"\nTodayduring the what can your manager do to help with your career aspirations\" section of my annual review, my manager basically told me she wouldn't help me and I should quit. FML\n",
"Todaymy cousin came to visit from Texas. It would have been great if he hadn't groped me and whispered, Incest isn't illegal\" when he saw me. FML ",
"\nA new enemy\nTodaymy cat jumped into my lap and sat on my headphone cord. I tried to get it out from under her by pulling on it. Big mistake. My cat is now eyeing the cord and will attack it if I move it again. I have expensive headphones and the cord is not interchangeable. FML\n",
"TodayI flew home to Germany to see my wife before I'm deployed, only to find her in bed with another guy. She explained that she wants us to stay together, but she can't take a year without being intimate with someone. FML ",
"\nTodaywhen I am asked to do something and I don't do it immediately, my mother threatens to twerk\" in front of my friends. FML\n",
"\nTodayduring my yearly review, I was told by my boss that mistakes in my paperwork will be investigated by our company legal team. He also said, Think of them as the TV or movie version of Internal Affairs\" and said I would be considered \"guilty until proven innocent.\" I can't afford to quit. FML\n",
"\nTodayI placed sticky mouse traps in my bedroom. it's now 12:05 a.m. and I've successfully caught a mouse. Too bad I'm scared of them and my husband is passed out asleep. I now get to listen to a mouse squeak all night and have to be up in 4 hours. FML.\n",
"Todaymy coworker returned the camera I lent her. After plugging the camera into my PC, I saw a file was still on it. Wanting to make sure I didn't delete something important, I opened it. To my horror, it was a video of my coworker pleasuring herself. She's old enough to be my mother. FML ",
"\nTodayI sent my boss a link to a website I thought would answer a simple question she'd asked. Turns out, yes, the site did answer her question, but it also had some very suggestive ads on it. Apparently I'm the only person in the office who uses adblock. FML\n",
"\nTodayit's the last day of finals week. Unfortunately the only test I've passed this week is the pregnancy test I took during my lunch break in a Subway bathroom. FML\n",
"TodayI thought it would be sexy to surprise my boyfriend by hiding in the closet naked and pouncing on him as he came to get his pants. I never got to the pouncing. Apparently my boyfriend has heightened reflexes so instead I got slapped hard across the face. My ear is still ringing. FML ",
"\nTodaymy boyfriend found a take-out menu under my bed. It's probably been there for months. He looked at it and said, Well, that explains a lot.\" FML\n",
"\nNoit's not a cult, not at all\nToday, I found out that not only does my sister consider Fox News reliable\" but her husband has been buying Trump merchandise. They owe me $1,900 but they're literally giving a millionaire money instead of me. FML\n",
"\nTodayI was driving to my company picnic with 85 lbs of meat in the back seat, and 1 gallon of homemade BBQ sauce and mustard in large pans riding shotgun. As I drove down a steep hill, the BBQ sauce pan slid forward, hit the glove box and exploded in my front seat. FML\n",
"TodayI gave my boyfriend a blowjob. It gave him a panic attack. FML ",
"\nTodayI went off for a jog. Outside, I saw my really cute neighbour, so in an effort to appear sporty, I accelerated and kept my head up. As I got close, I smiled at him, just when a huge fly flew right up my nose. FML\n",
"\nTodaymy wife told me alcohol gives me increased confidence without increased ability.\" FML\n",
"\nTodaymy professor tried to scare the hiccups out of me. Some pee came out instead. FML\n",
"\nTodayI woke up to find my cat has gone into heat. Her favorite thing to do right now is sticking her ass in my face and howling like a Nazgûl. FML\n",
"TodayI was doing a striptease for this guy over my webcam. I was shaking my ass while taking off my panties, but when they fell to my feet, I tripped over them and fell on my ass. FML ",
"\nTodayI was pulled over. The cop stated that he couldn't see\" me because I had \"blended in with the dark car background\", and that it looked like no one was driving. I was literally pulled over for being black. FML\n",
"\nFishy anxiety\nTodayI'm waiting for some live fish to be delivered for my tank. They were guaranteed by 1 p.m., so I took the morning off work. I've been unable to concentrate and have bee jumping every time a car door slams, so anxious to get them. It's now 4 p.m. FML\n",
"\nTodayI have been waiting for a call from a job I applied for. I soon got a text from my current boss, who doesn't know I'm job hunting, letting me know that the recruiter was trying to reach me. Turns out my number on my resumé was wrong. FML\n",
"\nTodayI wrote a note for my crush of 2 years, expressing all my feelings for him signed it as Forever your lover\" then I slipped it into his locker. Later that day, he walked back up to me, tossed the note at me and said \"You know I recognize your handwriting, right?\" FML\n",
"\nTodaymy car was broken into. What was stolen? My daughter's $11 One Direction poster. What will it cost to fix my car? $1,000. FML\n",
"Todayafter recently moving to an apartment, we've already been asked if we wanted to buy drugs, had a children's chair thrown through the front window, our door painted with CUNT LICKER\" and my laundry stolen. FML ",
"\nTodayI got left in the middle of slow dancing with a girl I liked. She came back and said, Sorry, I had to make sure the guy I really like knows that I don't like you.\" FML\n",
"\nTodayI wanted to remove my mustache hair with hot wax. The hair is still there, but my skin is all burnt dark brown. Tomorrow is my first day at school. FML\n",
"\nTodaymy company is doing so bad that I had to take down my symbolic first dollar so that I could buy a roll of crackers for dinner. FML\n",
"\nTodayI was convinced by my friends to watch an episode of the American TV show Here Comes Honey Boo Boo\". They said it was bad, but I didn't anticipate having a full-blown panic attack ten minutes into it. FML",
"\nTodaywhile at work, a customer came up to me, stuck his finger in my armpit, then licked his finger. FML\n",
"\nShithole\nTodayI was packing up to move when I decided to take a break. I went to get some water from the sink when a bug fell into my cup. Needless to say, I'm glad I'm moving. FML\n",
"\nToday we tried to have sex for the first time but I got so excited my blood pressure shot up and I got a nosebleed that didn't fully stop for nearly 30 minutes. Then when we tried again she accidentally headbutted me. The new bleeding still hasn't stopped and I'm feeling very lightheaded. FML\n",
"\nTodayI told my dad I was going to the gym. He stood up and clapped. FML\n","\nTodayI was on MSN when the conversation died. So I lied and told them I had to go get ready for a party, and that everyone was expecting me there. I spent the rest of the night playing The Sims. FML\n","\nTodayI hurt my arm in a scooter accident, when my dad came to pick me up instead of taking me to the hospital like a normal dad, he took me directly home where he spent a hour shaving and taking a shower so he would look nice\" when he went to the hospital while I clutched my arm in pain. FML\n","Todaywhile I was hanging out with a cute girl, I slapped her ass playfully. She told me that she was going to get me back. She slapped my ass later that night unexpectedly while I was holding in a huge fart... It came out. FML ","\nTodayI got talking to a pretty girl on the subway. Just as she was about to get off, I handed her my phone so that she could give me her number. She ran out with it. FML\n","TodayI was texting the guy I like. He's really smart, funny, athletic, and cute. This all changed when he told me he was jacking off. FML ","TodayI tried to be cute by sitting on top of my boyfriend's belly. While getting on top, I accidentally kneed him in his nuts. In pain, he jolted his head up and ended up banging his head against mine. Now I have a black eye and he can't walk without waddling. FML ","\nTodayI've been seeing this girl for three months. After asking her if she'd like to go out to eat with me, I realized that she never called me by my name, just hey you\". While we were out, I wondered what she had me saved as, so I texted her when she got up to use the restroom. It was \"free food\". FML\n",
"\nTodaymy girlfriend of 10 months moved to Europe and we may never see each other again, so I gave her a $200 sterling silver heart necklace as a goodbye present. She gave me a pack of gum. Cinnamon, which I'm allergic to. FML\n","\nTodayI finally had the chance to have sex with my crush. Too bad I couldn't get an erection. FML\n","\nTodayI went skinny dipping with my friends. A security man drove up the dock we were on with his bike. After informing us that the dock was closed, and noticing all of our swimsuits on the dock, he refused to move his flashlight beam from us in the water. FML\n","\nTodayI went to my boyfriend's house to break down and cry because his mother hates me for unknown reasons. I walked in, gave him a long hug, and started sobbing. I then saw his mother. She was visiting him to complain about how terrible a person I am. FML\n","\nTodayI have a better relationship with the machinery I've given names to at work than my actual coworkers. FML\n","\nTodayI was hiding Easter eggs around the house when my 7-year-old triplets woke up from their nap and saw me. They quickly realized that I am the Easter Bunny, and then they guessed that I am Santa. Now I have 3 crying second graders. FML\n",
"\nTodayI had to drive my husband to hospital after he tried to burn his pubes off with a lighter as part of a bet. On the upside, he probably won't be bugging me for sex for a while. On the downside, I'm married to a moron. FML\n","\nTodayupon arriving at a town festival, I was immediately singled out by a rent-a-cop. He began questioning if I had been drinking, saying he smelt it on my breath. He smelt his own breath. FML\n","\nTodayit's early-release before Christmas break for the kiddos, and my awesome-sauce boss let them hang out in our law office for the afternoon. So far, one has puked in the conference room, and the other has clogged the toilet. Only 2 hours to go. FML\n","\nUnloveableTodayI had a conversation with a girl on Tinder, for the third time this month. Just like the other two girls, she turned out to be a prostitute. Only prostitutes will give me the time of day. FML ","\nTodaysomeone tried to break into my car. They tried to do so by jamming a key into my lock, only for the key to break. I guess the key cut their hand, because I had the pleasure of finding the person's blood all over my passenger door. FML\n","\nTodaymy parents had a huge fight because my mom found out my dad was cheating on her. They screamed for half an hour. Right in the middle of my wedding. FML\n","\nTodayyet again, I got into an argument with my dad. I have a PhD in the subject. But he's entitled to his opinion\", for, as he said, he's read a summary of the history of the country in a tourist guidebook, and the general view doesn't have to be based on more detailed information. He also corrects me when I speak the language, which he doesn't know. FML\n",
"\nLove don't pay the rent\nTodayI begged my dad for money, for the first time ever, because even with two jobs I still can’t make rent. When asked why he sent way too little, he replied, You always said you’d prefer to get love from me rather than money.\" FML\n","\nHe will\nTodayI actually got to meet actor George Takei. He was really sweet and charming, and I was just thrilled. When we parted, I wanted to say either, I'll always remember this\" or \"I'll never forget this.\" It came out as, \"I'll never remember this.\" FML\n","\nPut it away!TodayI'm temporarily staying at my parents' place because my mother injured her knee and can't walk, and for the second time, I caught my father walking around with his bare dick. FML ","\nGoldfinger\nTodayI found out my boyfriend doesn’t think it’s important to wipe after he poops. FML\n","\nTodayI had to get a colonoscopy. Which wouldn't have been so bad if they had removed the camera from my rectum before waking me up. FML\n","\nTodayI found out that I'm not my girlfriend's only boyfriend. The other guy sells shoes on Facebook. FML\n","\nTodayI was at work lifeguarding and saw a kid drowning on the far end of the pool. I decided running would be the quickest way to get to her, but as I ran across the pool deck I slipped and hit my head. The kid's mother jumped in to save her child and then called an ambulance for me. FML\n","\nKids say the darndest things\nTodayI asked my 2-year-old if he loved me. His response? “No mama, stop.” FML\n","Todaymy mother and girlfriend were joking around and talking about the embarrassing things I've done. After they'd had a lengthly conversation, my girlfriend mentions And he always farts during sex.\" FML ",
"\nTodaywhile working at a nursing home, I was alone in the station and figured I could sneak one out. It wound up being very loud, and I could hear the faint snickering of a patient in the next room. Every time he saw me for the rest of the day he would burst out laughing. FML\n","Todaywhile tanning on a family cruise, I woke up to a crowd of people staring at me in disgust. Apparently, I'd fallen asleep, developed a boner, and started french-kissing the air. I had to sit through both the surveillance tapes and a grand bollocking from security in the aftermath. FML ","\nGet me out of here\nTodayI had a sleepover with two of my friends. We only had one bed, and it ended up with me against the wall. I then remembered that I'm very claustrophobic, and can't sleep. It's 4 a.m. FML\n","\nTodayI realized that a classmate and I have the same glasses. To prove it, I tried bending his glasses, since mine are flexible and can bend. I snapped his glasses in half. FML\n","\nTodaymy fiancé — a top chef — called me at work to make sure I would be home on time for the extra special dinner he'd prepared for me. The occasion, as I later discovered, was the end of our engagement. FML\n","\nTodaymy friend asked me if she could borrow my laptop and I can pick it up later and I said ok. I stop by her house later and no one answers. The next-door neighbor says that she left to go live with her mom. She lives in Detroit. I live in Maine. FML\n","\nTodaymy friend decided it was funny to burp in my face. The burp was actually vomit. We were in the food court at the mall. FML\n","\nTodayI was supposed to finally go out with my guy-friend that I have liked for a long time. He told me he would text me, and after waiting for hours for the text, I finally got it. It said, Guess what!? I just got laid!\" He forgot our date, had it off, and I congratulated him. FML\n","Todaymy girlfriend got up in the middle of sex saying, You're taking too long, I'm gonna go make some popcorn.\" I asked her if she could get me some. She said no. FML ",
"\nTodayI was at my boyfriend's house waiting for him to get out of the shower. Bored, I sent my friend a picture of myself pretending to make out with his bear rug. After the photo shoot, I looked in the doorway to find his dad staring at me. FML\n","\nMonday morning sucks\nTodayI came home to find that maggots had taken over my garbage can this weekend. We weren't home to catch it, and I didn't use the garbage this morning. On top of that, I hadn't had my caffeine for the day because I ran out and forgot. FML\n","\nTodaymy 26th birthday party got busted by my parents due to them coming home early because of a flight cancellation. Everyone had to leave, but not before my mother made me go to my room. FML\n","\nTodaymy daughter wouldn't stop yapping on about not being able to register on the new Harry Potter website. The amount of whiny jibber-jabber emanating from her cake-hole made me want to boot her from our family tree, and I had to resort to booze to wash the pain away. I'm a terrible parent. FML\n",
"\nTodayI witnessed a car accident. Being an experienced paramedic, I rushed to the scene to see if anyone needed help. As I assessed the people involved, one of them pickpocketed me. FML\n","\nTodayI went on a blind date. The guy greeted me with a What's up, bitch?\", which I wrote off as him just being really laid-back. By dessert, he'd asked me if my boobs are real, then when we finished, asked how many more dates it'd take before I put out. So much for that. FML","\nTodaymy boyfriend dumped me because apparently I don't appreciate how he's different from other guys. I only told him that showering once a month was not normal. FML\n","\nTodaya guy hit on me. It's such a rare occurrence that I didn't know how to react, so I panicked and said Sorry, I have to go!\" Then I remembered we were on a bus, and just turned around and awkwardly pretended he wasn't there. FML\n","\nTodayI'm found out I'm pregnant. My husband and I spoke at length about how we were going to handle things, which included him forbidding\" me from having an epidural, because he doesn't want our baby to \"come out addicted to drugs.\" FML\n","\nStalker vibes\nTodaya woman who has a history of being horrible came into my work. I had to help her, so I was determined to be so nice that she couldn't possibly complain about me, like she has about several co-workers before. Apparently, I was too nice. Now she loves me and wants me to help her every time she comes in. FML\n","\nTodayI went to a fast food restaurant. The guy behind me was a pretty hot latin guy. When I went to pay, my purse fell off the counter. My birth control pills, a condom, 3 super plus tampons and an extra pair of underwear I keep in there for emergencies fell out at his feet. FML\n",
"\nTodayI made fun of a girl singing passionately along to a song on her radio while in traffic next to me. She decided that her chocolate milkshake would make a good addition to my brand new seat covers. FML\n","TodayI asked my husband to watch our kids while I cooked food for him. Apparently I asked in the wrong tone, because now he's pouting and won't eat. FML\n","\nBoomheadshot!Today, my boyfriend headbutted me during sex. This wouldn't be so bad if it was the first time. FML ","\nTodayI was at Barnes and Noble with my dad, where he refused to buy me a book because I already read too much.\" FML\n","\nTodayI received my camera in the mail. I had sent it back to the company because it wouldn't turn on. As I was reading the note they put in, it said, Battery was put in backwards. No other problems found.\" FML\n","\nRun for the hills!\nTodaymy girlfriend asked me the details for al-Qaeda's plan during 9/11 for an essay. I had no idea and she said she just expected me to know, since I'm one of those people.\" I'm Iranian. FML\n","\nTodayI arrived at work six minutes late due to heavily congested traffic. This is just two days after my boss put out a memo saying that anyone who's late to work from then until the new year will have their holiday bonus pay forfeited. FML\n","Todaymy girlfriend woke me up in the middle of the night to have sex. Over breakfast, she said it was the most intense, primal and mind-blowing sexual experience she ever had. Problem is, I don't remember a damned thing. FML ","\nTodayas I was pulling into work at 15 weeks pregnant, I projectile vomit all over myself and my vehicle. I had an emotional breakdown as I went back home, and called my boss to let him know I would not be in that day. I am now looking for a new job. FML\n","\nReady for the grill!\nTodayat work, the chest freezer was accidentally turned off. I work at a vet and the freezer is our morgue. It got opened before anyone realized the contents had thawed. FML\n","\nDisney 2021\nTodayI realised that I'm kinda living the life of a Disney princess, because I'm lonely and all my friends are animals. Yes, I also talk to them. FML\n","\nTodayI was counselling a soon-to-be teen mom. She has a younger step-brother, and when I asked her how she handled him when he cries, she said, Oh, that's when you cover their face until they stop!\" FML\n",
"\nTodayI accidentally sent a nude to my girlfriend's father. He screenshotted it. FML\n","\nKnackeredTodaymy boyfriend and I fell asleep twice during sex. FML ",
"\nTodaymy ex-boyfriend and his new girlfriend bumped into me at McDonald's. I was sitting alone at a table with a big mac, two large fries, a large drink and 1 case of chicken nuggets. FML\n","\nTodayI picked up my daughter from preschool. Her teacher handed me her nap blankets and mentioned there was an extra article of clothing I might want to take home. I looked in-between the blankets and saw a pair of my giant granny panties that had gotten mixed in with her stuff. FML\n","\nTodayI was jumped and savagely beaten to the ground by a group of six-year-olds wearing Disney princess masks. FML\n","Todaymy wife found out my son masturbated and wanted to send him to counseling. Thinking she was overreacting, I told her I masturbated when I was a teen so he should turn out like me. She began sobbing uncontrollably. FML ","\nPublic freakout\nTodaysome punk got up in my face yelling at me, pushed my wife and scratched my car with a, What you gonna do, old man?\" attitude, and yet I’m the bad guy who gets arrested because I open-palm slapped him and he fell into a glass window and fucked up his face and neck, probably permanently. FML\n","\nRemember socialising?\nTodaybecause of this fucking virus I was really excited to actually talk to another person. FML\n","\nTodaymy new roommate sent me a picture of our toothbrushes bristles touching with the caption Look! I made them kiss!\" FML\n","\nTodayI walked into the kitchen and accidentally broke my mother's vase. I said, Accidents happen.\" She replied, \"Yeah, like your birth.\" FML\n","Todaymy girlfriend was getting up to leave and I, trying to be romantic, got up behind her and tried to swing her back down onto the bed and kiss her simultaneously, misjudged the distance and threw her into the wall, her head then bounced off the wall and into my forehead, spraining her nose. FML ","\nTodayI got a new haircut. I was feeling pretty confident, until coworkers and family members kept making comments like, I think you gained a little weight\", \"You look older\" and \"Do you still like guys?\" Apparently, my new haircut changed my waist size and my sexual orientation. FML\n","\nTodayI went hiking with my family. A local had told us about the trail, saying the two mile walk would lead us to a seventy-foot waterfall. After seven miles of trekking in the sweltering sun with no food, we finally found the waterfall. It was barely ten feet tall. FML\n",
"\nTodayI worked a short shift at work, getting sent home early because it was slow. In the time I was gone, my family decided surprise me by rearranging my room and put in my new desk. They also surprised me when I learned that they'd spilled a slushie on my very expensive computer. FML\n",
"\nToday my boyfriend told me that dirty talk with me was like potty training a puppy. FML\n","\nTodaymy boyfriend and I were looking through an old photo album of mine. I turned to a page with a picture of me on my last day of college. I thought the picture was quite nice. He turned to me and said, Don't worry, I take bad pictures too.\" FML\n","\nTodayI spent ten minutes looking for my cell phone in the dark, only to realize the light I was using was my cell phone's. FML\n","\nTodayI called my boyfriend to let him know that I'm pregnant. He instantly replied Bullshit!\", then hung up and apparently skipped town. FML\n","\nTodayI used so many different perfume testers that I passed out on the bus. FML\n","\nTodaywhile having a sneak through my brother's browser, I found a bookmark for a Google Docs file. It was a short story involving him horrifically killing our entire family. It ended with the words: And that is what happens when people don't respect the author's privacy.\" FML\n","\nTodaymy godmother informed me that the rule of thumb my ex had used for our relationship during a year of cohabitation was taken directly from a Cesar Millan book on How to train dogs.\" FML\n","\nTodayI learnt that my guinea pig can shoot poop across the room like a tiny brown torpedo. How did I find this out? It landed in my coffee. It wasn't until after I'd finished my coffee that I noticed it. FML\n","\nKinda sweetTodaymy boyfriend invited me over, so I went, not thinking anything of it. To my surprise, he broke up with me. I was pretty upset, and as I was leaving his mom handed me a box. When I got home, I opened it. His mom had baked me a break-up cake. FML\n","\nTodayI was writing my narrative essay for my English class. When I turned it in, I was really proud of what I thought I wrote. Evidently for some people listening to music while writing essays is a bad thing. My essay was filled with little bits of ZZ Top lyrics. FML\n",
"\nTodayI was in a toilet cubicle, when I overheard two of my friends at the sink talking about how ugly and skinny I was. FML\n","\nShot\nTodaywhile driving home, I saw a cop with a speed gun hidden\" by the side of the road. I went to slow down so the fuck-knob wouldn't be able to ticket me. I then had a brain-fart and floored the gas instead of hitting the brakes. Hello speeding ticket. FML\n","TodayI got an email from a guy to whom I sold my old phone to over eBay. Turns out I forgot to delete the nude photos of myself and my boyfriend that I had stored up. His email asked me for any PIN numbers needed to use the phone, and oh by the way, nice tits.\" FML ","\nTodayI was in my car with my window down at a red light. Outside, a sweet old lady was sitting on a bench with her dog sleeping next to her. I yelled out the window to tell her how cute her dog was. She replied, He's dead\" and cried. FML\n","\nTodaymy mom was convinced that the lawn gnomes we bought from Wal-Mart were secretly conspiring to kill us. FML\n","\nTodaywhile I was sleeping, apparently I rolled over towards my fiancé and told him We gotta save the turtles!\" and had a five seconds long fart. Now he won't stop making fun of me. FML\n","\nFair enoughTodaymy long-term boyfriend insisted on me going down on him. When I asked what he would do in return, he said, I was thinking McDonald's.\" FML ","\nKitten time\nTodayI came home from putting my 18 year-old cat to sleep to find 3 months worth of prescription food, medication and cat litter on my porch. It isn't returnable. FML\n","\nZeitgeist\nTodaymy dishes smelled so perfume-y after going through the dishwasher and a clean glass of water tasted soapy. I checked the pods my husband bought and loaded into the dishwasher to make sure we never got that brand again. They were laundry detergent pods. I was essentially a millennial eating a Tide Pod. FML\n","\nTodayI was driving to my new home with a lot of my belongings in the car. I could hear things shifting in the back. When I parked, I opened the door, ready to catch my vodka. I caught it- and watched my laptop slide out of the car, onto the concrete, and break into 3 pieces. FML\n","\nTodayI noticed that my son only really looks like me when he's straining to take a dump. FML\n","\nI miss the hungry years…\nTodaymy cat let a mouse sit on his paws for several minutes, then just sat and watched as it scurried into a crack in the drywall. My cat is only 4. FML\n","\nTodayI had to dig through my dog's poop again because I thought I saw a worm, but it was just the remains of the paper towels my husband leaves all over the house. My efforts to make them both stop have obviously fallen on deaf ears. FML\n",
"\nTodayI was playing my guitar and felt something like an itch under my foot, so I attempted to scratch it by rubbing against the floor. The big cockroach made a very distinct crunch\". FML\n","\nTodaymy cat woke me up by sharpening his claws on my breast. FML\n","\nTodaywhile looking through a stack of possible pictures for Facebook, I found one I really liked, until I noticed that I have recently developed a bald patch. Problem? I am a 22 year old woman. FML\n","Todaywhile having sex with my girlfriend on the bathroom floor, I felt something tickle my balls. I looked back to see her sister's kitten getting in on the action. I think I just had my first threesome. FML ","\nProperty law\nTodayI asked my boyfriend, who’s a massage therapist, if he could help my mom with her chronic migraines by massaging her head and neck. My dad came home, saw them in the dimly lit room and knocked my boyfriend out cold for touching his woman.\" My boyfriend dumped me and wants my dad arrested. FML\n","\nTodayI was woken up by a funky smell. My dog had eaten a dead bird and thrown up all over my bed and floor. At 4 o'clock in the morning I had to clean up regurgitated bits of bird, feathers, blood and dog food. The smell still hasn't gone away. FML\n","\nTodayI noticed that my son only really looks like me when he's straining to take a dump. FML\n","\nCall CPS!\nTodayafter years of having seasonal allergies and months of having my throat close up, my mom agreed to see a doctor, only to insult me in front of the doctor, saying I just find new ways to make their lives harder and I'm probably making it all up. FML\n","\nTodayI was in a public restroom when my almost-2-year-old figured out how to open the door and run out. Half-a-dozen strangers watched me scramble to pull up my pants and moon everyone before running after her. FML\n","\nTodayI yelled at my dog for waking me up growling and barking out the window. He was doing it at the person stealing my car. FML\n","\nTodayI found out that the girl who my high school boyfriend cheated on me with is now the woman my husband is having an affair with. FML\n","\nSecond time\nTodayI found myself locked in a bathroom for the second time in my life. This time at least I was at home. I live alone. I had to break the window on the shower door and crawl out. Now, I need to crawl in/out to shower, brush my teeth and more. FML\n","\nHoliday cheer\nTodayI’m convinced my mother in law comes over every holiday just to make me miserable. She comes in, criticizes me food, snarks then ignores the kids. I dread every holiday and spend it getting drunk and casting F-you glances at my husband. Is it wrong to buy her a casket for the next holiday? Is it really? FML\n",
"\nTodaywas the first day of my new job. My boss admitted that they hadn't cleaned the employee bathroom for over two months. My first task: clean the employee bathroom. FML\n","\nNo kinkshaming on FMLTodayI had my first wet dream. I woke up sweating and soaking wet. Too bad I dreamed about having intense sex with a cardboard box. FML ","\nTodaymy mum dismissed my diagnosed schizophrenia as too much time with those earphones in\". FML\n",
"\nTodayI snuck out to go see my girlfriend. When I got to her house, I left my bike out front and we went on a nice walk around the block. We passed a homeless-looking woman going the opposite way. About ten minutes later, the same woman passed us, on my bike. FML\n","\nTodayI was studying on a bench outside my dorm when the leg snapped. I decided to do the right thing and let administration know what happened. After assuring me it wasn't my fault, and having me fill out an incident report, they billed me $400. I can't enroll for next semester until I pay. FML\n","\nTodayI got a new cat. I tried to reenact the opening scene from Lion King, where in Simba gets held up for everyone to see. The fan was on when I lifted my cat up. FML\n","\nTodayI was working my job as the person who checks people in at the gym. A sweaty chubby woman came up to me complaining about how our staff seems so fit. I replied with we like to hire people who have bodies that motivate our clients!\" She gave a blank stare, then said \"so how did you get the job?\" FML\n","\nTodaywhen I asked my boss why my bonus was cut in half, he replied, I have no idea what you really do.\" I'm the IT Manager. FML\n","\nTodayI started my community service at the dog pound. I like animals so I thought it would be a good place to do it. As I arrived they were throwing dogs that had been euthanized into a dump truck to be taken to a landfill. That was my job for the day. FML\n","\nTodayI pinched a nerve in my shoulder while pulling the bedcovers higher in the morning. After excruciating pain all day, I climbed back into bed at night, twisting my knee in the process. FML\n","\nTodayafter months of my doctor telling me that my heart palpitations are simply due to anxiety, and that I'm perfectly healthy, I decided to weight train to face my fears. Two hours later, I was in the emergency room. FML\n","\nTodaya man with a face like a corpse's shoe started talking to me in the long queue at the Post Office. Apparently, his mother invented the banana, and he's first in line for the throne in France if ever Prince Harry dies. And his breath smelled like Satan's ass gas. FML\n","\nTodayI was waiting at a traffic light next to an ice cream van. The man in it turned to me and winked, making sexual hand gestures. I felt my childhood die horribly as I watched. FML\n","\nTodayI've been getting calls for over a week on my home phone, cell phone, and the work phone at my night shift, in which someone whispers terrifying Satanic-sounding chants at me. I've now found out that the caller is my best friend\". His explanation: \"You seemed lonely, man.\" FML\n","\nTodaymy wife of four years confessed to me that she only married me for the money. FML\n",
"\nNo kidding\nTodayI was ecstatic that the pregnancy test I took was negative. I went to high five my boyfriend as I told him the good news. Apparently, it’s monstrous, unladylike and weird for a woman to not want children. When I pointed out he doesn’t want kids either, he said, That’s normal for guys.\" FML\n","Todaymy girlfriend asked me how big the Sun would be compared to the Earth. I didn't have anything on me to help demonstrate, so to imitate the Earth, I made a small hole with my index finger and thumb and said Okay, imagine a ball this small.\" She then looked at my crotch. FML ","Todaythe guy I've had a crush on for a while called me and asked me over. I took a cab to his place and when I got there he was dressed in leather and wore a mask... It took me a 20 dollar cab fare to realize my crush is a freak. FML ","\nTodaya woman approached me in the street and slapped me, ranting about how I stole her man. I don't even know her man, or her, and I live over a thousand miles away in Scotland. I'm back in town for the first time since my childhood to attend a wedding. FML\n","\nTodayI was at University when a giant mascot started walking in my direction. As they walked past, they whispered my name seductively. I still don't know who it was. FML\n","\nTodayI stepped outside for a smoke. It was 1 a.m. Thinking no one was around, I let out a series of loud, nasty-sounding farts. I looked over to my left to see the neighbor, whom I've never met, also smoking, and staring at me. That was his first impression of me. FML\n","\nTodayI was extremely constipated. This is a side effect of the medication I take to alleviate my stomach condition. Due to this same condition I can't eat much roughage. We have no laxatives or stool softeners, and I have been shitting bricks for three days. FML\n","TodayI realized my boyfriend's right hand gets more action in a week than I do in a month. FML ","\nTodayduring a football match, the referee declared a goal as invalid. The dad of the kid who scored didn't agree, which led to an all-out fight among all the kids' parents. FML\n","\nTodaymy mum prepared my bag for football practice. In the changing room I found one of her thongs. FML\n","\nTodayfor the 2nd time in a month, I've been rear-ended at a stop light. One insurance company refuses to pay because of prior damage from the 1st accident, and the other won't pay because of new damage not caused by their client. I just want my car back. FML\n","\nRude awakening\nTodayI experienced the fright of a lifetime when I woke up and heard my bedroom door opening. Fearing that there was an intruder, I picked up a bat and opened the door, ready to whack the mystery intruder. There was no one there. No one, except my cat, who apparently knows how to open doors now. FML\n","\nTodaymy neighbors got a motion sensor light that points at my window. It's so sensitive that it goes off every time an insect flies past. FML\n",
"\nTodayI was diagnosed with diabetes. I went to tell my grandpa, who immediately said, I'm sorry, let's go get ice cream to cheer you up.\" FML\n","\nTodayI discovered my mom has been using my credit card to buy everyone's Christmas presents. FML\n","\nTodayI was babysitting my boss' kids. I brought chocolate for them and the youngest said he had never had chocolate and didn't want any. I told him he should always try new things and should eat it. He did. He's allergic. FML\n","\nTodayI had a few friends over. Wanting to seem cool, I yelled at my girlfriend to get me a beer. She chucked four bottles at my head. All my friends cheered her on. FML\n","\nTodayI had to go to the hospital to get blood taken. The nurse mentioned how pronounced and easy to see my veins are. I guess that explains why she missed five times in a row. I'm surprised my arm doesn't look like a heroin addict's right now. FML\n","\nTodayat 3am, my boyfriend's phone notifications kept going off. I attempted to wake him up, but he didn't budge. When I went to silence it, I saw his Ashley Madison notification, followed by Tinder, Zoosk, and Plenty of Fish. We've been monogamous over a year... or so I thought. FML\n",
"\nStatisticsTodayI found out that my 7 friends, with a total of 23 past boyfriends in 11 years, have had 0 orgasms during sex. As someone whose sex ed was basically porn, it felt like finding out Santa wasn't real, but worse. FML ","\nCheaply romantic\nTodayI walked into a dollar store as my boyfriend's girlfriend. I came out as his fiancé. FML\n","\nTodayI took my kids to the mall to see Santa. While waiting in line, my eldest got bored and loudly complained, I don't know why we're here. Santa's not even real.\" I don't think any of the kids within a hundred feet took the news very well. FML\n","\nSensitive subject\nTodaywhilst working in a law firm, I took a call from a criminal, demanding that we apply for bail as he didn't like being in jail. When I tried to explain no one likes being in jail, he became angry and hung up the phone. FML\n","\nTodayI had a very long, complicated talk with my girlfriend. Apparently, since she isn't religious, she doesn't have to give anyone Christmas presents, and yet expects everyone to give her some. She then told me what I should get her. FML\n","\nTodayIt was my fiancé's 21st birthday party. It ended with him too drunk to walk and wailing about how much he misses an ex girlfriend of his that he dumped 4 years ago. FML\n","\nTodaymy girlfriend left her phone on a bus. With no way to pick it up, I drove 40 miles through Friday night Boston traffic to get it from the bus company office. It took me four hours. Bored in traffic, I discovered the texts from her other boyfriend. FML\n","\nTodayI spent fifteen minutes looking for my phone in my car before I realized I was using it as a flashlight. FML\n","\nTodayas usual, I went to pick up my brother and sister from school in the rain. When we got to my truck, I realized I had locked us out. We had to walk home in the rain, only to find the spare house key had not been put back in its spot since the last time it was used. FML\n",
"TodayI brought my girlfriend home while my parents were at work, and things got a little heated. We lost track of time, because the next thing we knew, my dad burst into the living room. He doubled over laughing and asked how much I paid her. FML ","TodayI found out that when my girlfriend said she gave up sex for lent, it was just with me and not my brother. FML ","\nTodaywhile talking to my sister, I explained to her that the reason I hope I end up having a girl is I want my daughter to love me the way I used\" to love my own mother. I didn't mean to say it in the past tense. My sister told my mom. She's planning my baby shower. FML\n","\nTodayI dissected a baby pig. All I could think about was Wilber from Charlotte's Web. FML\n","\nTodayI went to get my hair done. The hairdresser managed to catch my eyebrow piercing in his comb and almost rip it out. I now look like I have a gunshot wound on the upper right hand side of my face. I'm getting married in a matter of hours, and I still had to pay £100 for the hair cut. FML\n","\nTodayI recently gave birth to my daughter, and my husband and I both have dark hair and bushy eyebrows. We never thought it was a problem until our daughter was born with a dark, bushy unibrow. Now I'm too nervous to take pictures of her 'cause our family and friends laugh every time they see her. FML\n","\nTodayI found out the name on my driver's license is incorrect. I don't know what's worse: the fact the government can't even copy a goddamn name correctly, or that it took me three months to notice, when a cop nearly arrested me for carrying a fake\" license. FML\n","\nTodaymy best friend told me how his batshit insane girlfriend keeps questioning his sexuality and thinks we're screwing behind her back. He's so desperate for a relationship that he's decided to stop hanging out with me. Goodbye 7 years of friendship. FML\n","\nTodayafter months of job hunting, I finally got a phone interview with a company. Excited, I prepared for the interview and conducted extensive research on the company. The interview ended within a minute. They'd got the wrong person. FML\n","\nTodayI went on a blind date that my sister had set up. When I arrived at the coffeeshop, I approached a man waiting by the counter, asking if his name was Tim (my date's name). He looked at me and said no and then left with a drink clearly labeled Tim\" in bold letters. FML\n","\nTodayI had a job interview at a Holiday Inn. I got there ten minutes early and sat until 1:00 p.m., then told the person at the front desk I was there for my interview. She called the manager, who said that no interviews were scheduled today. I'd gone to the wrong Holiday Inn. FML\n","\nTodayI got in the shower, washed my hair and shaved because I wanted to look great for a big date. I got out, brushed and dried my hair and spent an hour putting it up in the perfect hairstyle. Running late, I quickly put on my new dress, looked down and realized i had only shaved one leg. FML\n",
"\nTodaywhile getting ready for a friend's wedding, I was curling my eyelashes. My cat decided to jump onto the towel rod. As I went to catch her, I ripped all the eyelashes out of one eye. I called my boyfriend crying. When he saw me, he laughed and said, You look really surprised in that eye.\" FML\n","\nTodayafter struggling with an eating disorder and hiding my symptoms for months, I got up the courage to tell my mom that I need help. Then she asked if an ice cream would make me feel better. FML\n","\nTodaymy boss fired me for dating a co-worker. There's no policy forbidding it; he just thought it was unfair that I could get with the hottest girl who works here\" but he can't. I live in an at-will employment state. FML\n","\nTodayI woke up to my friend stroking my face with the bottom of his foot and whispering, Shh, you're okay.\" FML\n","\nTodayI was walking my new dog and saw this girl that I've had a crush on for months. When I approached her, I tried to look 'macho' with my dog. However my dog thought it would be more attractive to pee on my leg. FML\n","\nTodayI was sitting on a park bench with my very elderly grandfather while listening to music at a low volume. Suddenly, he turned to me and said very loudly, I DIDN'T KNOW YOU HAD AIDS!\" I received strange looks from everyone because he mistook my ear buds for a hearing aid. FML\n","\nTodayI learned that my anxious and obsessive mother is going to drive three hours every weekend to attend a Johns Hopkins medical course on stress reduction. Why is this bad? I just left home for college and have enjoyed my last two weeks of freedom without her around. I attend Johns Hopkins. FML\n","\nThis is going well\nTodaymy husband is so bored with speaking to me, he literally walked outside when I was mid-sentence during a conversation about how I need more attention in our relationship. We've only been married 3 months. FML\n","\nTodaymy boss flipped me off in traffic on my way to work. FML\n","\nTodaymy wife and I were born on the same day, married on our birthday date. Today is our birthday and anniversary, and today we are getting divorced. FML\n","\nMedicare for allplease\nToday, I'm sitting in the ER with my 6 ovarian cyst rupture. The pain meds have already worn off and my vag hurts. I also had my gallbladder removed last June, and my right ovary removed last January. The staff here remember me. Most expensive friends I've ever had. FML\n","\nOne day with him\nTodayI finally made a move on the guy I've been crushing on for years...by getting so drunk that I puked in his lap. FML\n","\nTodayI made my young niece lunch. After she claimed to have eaten it all, she wanted to go out and play. I was putting my shoes on when I found part of the sandwich I made her stuffed in my shoe. FML\n","\nWho? Where?\nTodaymy husband bought me a beautiful pair of earrings for my birthday, to match the necklace he'd spent months searching for online the previous year. What necklace? He gave me a watch he found at Walmart last year. I wonder who the lucky girl with the necklace is. FML\n",
"\nWhat a treat\nTodayI asked if my friend wanted to come meet my dog and give him a treat. We were walking to my back yard, her holding 3 hot dogs, when she said, I think your dog is dead!\" I said, \"No, he's just old and sleeps all the time and won't wake up until you pet him because he's deaf.\" He was dead. FML\n",
"\nTodayI was checking out my boyfriend's facebook profile. I saw that he had just taken the How long will it take for your girldriend to realize you're cheating on her?\" Quiz. FML\n","\nTodayI was in a store using the only bathroom there. After I was done, I realized I couldn't open the door. Panicked it locked me in, I banged on the door, and screamed for help. The security and a whole group of people gathered, only to find that I was pulling the door instead of pushing it. FML\n","Todayat the point of orgasm, my boyfriend screamed out, Is this all there is?!\" then rolled over and stared blankly at the ceiling without speaking for ages. This happens a lot. FML ","\nTodayI got screamed at to the point of tears by a Starbucks employee for giving an obviously fake name\" to confuse one of the employees. I told her my real name. My name is Ian. FML\n","\nTodayI almost crashed my car because I was checking out an Old Navy mannequin wearing a bra. FML\n","\nTodayour power went out due to some severe storms. My daughter, who is 18, asked me why the lights on the car still worked. FML\n",
"\nTodayI sold cigarettes to a woman who promptly told me that she smoked meth. It's only my second night working this job. FML\n","\nTodayI baked some brownies and after my mom ate one, I joked that I put weed in them. Turns out the placebo effect's a bitch, because she quickly started acting high as a kite. One bitch fit later, the brownies are in the trash and I'm grounded until I tell her where I bought the weed\". FML\n","\nPhone holder\nTodayI had to sit in between two boys on a two-hour bus ride. They were watching a movie and each of them had shared an earphone. They made me hold the phone up so both of them could see the screen. FML\n","\nTodayI went to the gym with my grandma. In the span of an hour, she was hit on more than I ever have been in my life. FML\n","\nTodaymy elderly neighbor along with our community church's priest came to my house and demanded to give them the girl\". The girl is my 3-year-old daughter, who has natural born red irises and is photo-sensitive. And yes, we are also Romanian. FML\n","\nInsane parents\nTodayI was wondering why the new book series I'd ordered hadn’t arrived. I ordered new books because my mom constantly bitched at me about being on the internet too often. She took my laptop away to teach me a lesson\". Only I need my laptop to get the confirmation number to track my books. FML\n",
"\nTodayI found out what happens when you sleep with a girl your chemistry major friend likes. He put silver nitrate in my body wash and shampoo. I look like I survived an explosion in a Sharpie factory. He says it'll come off in a few days\". FML\n","\nTodayI realized my girlfriend has more hair on her abdomen than I have on mine. FML\n","\nTodaymy band was playing its first serious gig. I was in the middle of a solo when a drunk guy tackled me, causing me to crash into the drums, breaking them and my guitar, hitting our drummer, knocking him out. FML\n","\nTodayI learned how unhappy my husband is in our marriage. Apparently he also can't find a good woman. We didn't have a heart-to-heart, I read his woes in a blog. FML\n","\nTodayI was at a restaurant with my boyfriend. I look him straight in the eye and ask him: What's the first thing you think about when you look at me?\". His answer: \"Can I finish my steak?\" FML\n","\nTodayI witnessed a large woman pee on a pregnancy test in the middle of a Walmart parking lot, clean herself off, then wander around with the test hanging out of her mouth, waiting for her result. Where in the name of Christ do these people come from? FML\n","Todayinstead of staying home, I took an hour-long bus ride in the middle of the night to my girlfriend's place because on the phone she said, I desperately need your body right now\". It turned out she was just cold. She is also on her period. FML ","\nTodayI thought I was going on a date. About 20 minutes into it, after giving her my arm to hold (like a true gentleman) it came up in conversation that my brother is gay. Her response: oh, so both you and your brother are gay?\" FML\n",
"\nTodaymy flight was at the other side of the airport. I ran to the gate, to find that the flight had moved to the other side of the airport. So I ran again to miss my plane by a minute. However I did get a new flight... at the other end of the airport. FML\n","\nTodayI woke up at 10:30 feeling great and saying to myself, Thank goodness it's the weekend!\" I then realized it's Friday and I missed my final. FML\n","\nNot my sunnies!\nTodaywhile out shopping, a middle aged man snatched my sunglasses off my face, threw them off the ground, and stomped on them, saying, That’s what you get for trying to look cool, asshole!\" I suffer from light-induced migraines. FML\n","\nSession done!TodayI thought it would be fun to have a sex session with my boyfriend. I sent him a suggestive message, and 30 minutes later he texted me back to let me know he was done. FML ","\nUrges\nTodayI accidentally bought chicken fingers. I couldn't even make it two days as a vegetarian. FML\n","\nTodaywhen I was ordering pizza, I got a text from my mom saying I love you\". When the man thanked me I accidentally said, \"I love you too.\" FML\n","TodayI've had no sleep. Why? Because my housemate has a new girlfriend and the walls are too thin. After round three of them shagging, I was exhausted from holding my breath each time the new girlfriend screamed. I also realised that was the closest I'd been to sex in months. FML ","\nTodaymy psychotic step-dad asked me if I'm doing drugs. I replied with a massive amount of sarcasm: Yeah, all of 'em. Especially meth.\" He flipped out, searched my room top to bottom, then grounded me \"for good\" until I tell him where I hid the supposed drugs. FML\n","\nTodaymy beloved pet chicken ran away from home. I got so distraught that my dad offered to buy me dinner. Specifically, KFC. FML\n","\nTodayduring dinner, my mum asked why I've been so upset recently, so I just admitted it was because my girlfriend had cheated on me. At some point during my venting, I asked why this stuff always seems to happen to me. My dad looked up from his plate and said, Probably karma.\" FML\n",
"\nTodayI woke up after a night of drinking in my backyard. All I was wearing were my boxers and one sock. I staggered up to see my car halfway through my garage wall with a note saying Sorry Dude\". FML\n","\nTodaymy mother-in-law announced that she's going to be moving into the apartment next to us. Oh joy. FML\n","\nTodayI bit into a barbecue-ed corn cob, forgetting I had a filling on my chipped front tooth. I re-chipped it. FML\n","\nTodayI played paintball with a bunch of friends. By the end of the day, my girlfriend and I were the only people left on the field. She shot me mercilessly, and I screamed like a little girl. 30 people watched, 4 people filmed. FML\n","TodayI finally had the opportunity to have sex with my girlfriend. This would be the first time for both of us, so I tried to make it really special. I had everything planned out to be very romantic. She loved how it was set up. After all this, I couldn't get it up at all, all night. FML ","\nTodayI visited a waterpark with friends. At one point, a woman floating near me suddenly says to me, How are you doing, honey?\" Instinctively, I replied, \"I'm well\". The woman gave me a strange look and I turned around to find she was talking to her child directly behind me. FML\n","\nTodaywhile socializing after a church service, I discovered I'm still referred to as Fireshit's brother\", after an incident a year ago which involved my sister screaming \"the devil is coming out of my anus!\" from the lavatory. FML\n","\nTodayI got cited for internet plagiarism\" and called to the dean's office. I'd been sitting a closed-book written exam, and my teacher had been breathing down my neck the whole time. FML\n","\nTodaymy two year old girl said motherfucker\". Everyone laughed, even her grandparents. Our family is insane. FML\n","\nOverreaction much?\nTodaymy boyfriend's mum yelled at me for, nagging Stephen to get married when he isn't ready.\" I mentioned marriage once. At my sister's wedding. When prompted by my grandmother. FML\n","\nTodayI walked in on my daughter trying to blow-dry the sweat off her armpits instead of showering. FML\n","\nTodayI wasn't feeling well, so I took my temperature with a thermometer from my sister's bathroom. I later found out that I actually used my sister's rectal thermometer. At least I don't have a fever. FML\n","\nHelter Skelter\nTodayI decided to face my fears and go on my first upside-down ride. Unfortunately for me, the two men in front of me had chosen to eat before the ride and I walked off with bits of strawberry and bacon in my hair, my clothes drenched in whitish fluid, not to mention the stench. FML\n","\nTodayI got back from a 6 month deployment overseas. My girlfriend of 3 years couldn't pick me up from the airport because she had an intramural softball game to go to. FML\n","\nTodaymy house was broken into. Apparently, I have nothing good enough in my house to steal, so they took my cake. FML\n","\nTodayI was late to a lecture when I tripped up the stairs. With a few hundred people already staring and laughing at me, I started to curtsy to my adoring fans\" but instead fell backwards down the massive flight of stairs. FML\n",
"\nTodayI went to a trampoline park and jumped into an adult-area foam pit that apparently used to be for children. I guess it never occurred to them to change the depth of it, as I now have a fractured ankle. FML\n","TodayI realized when I'm on my phone, I tend to play with my penis, even in public. FML ","\nTodaymy friend awoke me because I was talking in my sleep. When I asked her what I was talking about she replied with, Let's just say you were having tea with the Queen of England. And a duck. You're really good at quacking.\" FML\n","\nClassy\nTodayI've got two family members over to stay. So far, I have found a dirty Q-Tip, a nasty toe nail and had to clean up period blood from toilets, bin, and the floor. FML\n","\nTodayI parked in my employee of the month\" parking spot by the front of the store and started my shift. About halfway through my shift, a customer backed into my vehicle, got out and checked, then drove off before I could come outside. Perks of being the best employee I can be. FML\n","\nTodayI'm on a train, feeling good because I got upgraded to first class. The man opposite me just slid me a note saying, Wee plooky cunt, fuck off!\" Charming. FML\n","\nTodayI shared an elevator alone with an attractive co-worker. On our way up, she let out a loud, noxious rip. She covered her nose and mouth while giving me an accusing look, as I said with a straight face, Excuse you.\" Later, I received a note from HR for harassment. FML\n","TodayI told my parents that I wanted a little brother. My dad apparently thought it would be funny to tell me that my mom just swallowed my little brother. FML ","\nTodayafter ordering a custom $200 Valentine's Day gift box for my husband, he gave it away to a female coworker upon delivery because Valentine's Day isn't for guys. I hope she like the new Xbox one controller and all the gift cards as well. FML\n","\nTodayI was watching Ratatouille. Piece of advice for starving students: never watch it when you've only eaten two apples in two days, or you'll find yourself in the ridiculous position of being jealous of a fucking rat. FML\n","\nTodaywhile browsing through Walmart, I slipped on a piece of clothing and fell backwards into an obese lady’s butt. When I landed, she farted. FML\n","\nTodayI was playing with my phone after midnight, and I kept getting calls from a withheld number. The guy just breathed heavily and wouldn't speak. When the third call came, I asked who the hell are you?\" The call ended, and my dad yelled from outside my door: \"ME! Now go to sleep!\" FML\n","\nTodaymy father took me out for some driving lessons. I accidentally reversed while still in the driveway, and I instinctively hit the brakes. In my panic, I accidentally let go of the brakes, and ended up reversing straight into our house, all while my father yelled NOOOOOO!\" FML\n","\nTodaymy dad knocked me down the steps while chasing my brother around the house shouting, Get back here you pervert!\" at the top of his lungs. I have a concussion and a vertebrae fracture because my dad is a religious nutjob and he caught my 22-year-old brother having premarital sex. FML\n",
"\nRoommates from hell\nTodayI came home from a long day from work, only to find a strange woman in my apartment. She explained that my roommate told her it was OK to spend a few days here. I guess he forgot that the room was mine. FML\n","\nTodayI was riding on my usual bus, when I noticed a man staring at me. I was having a really bad day, and said Can you please stop staring at me?\" He then replied with \"I'm just trying to look out the window, and your head is in the way. Don't flatter yourself.\" FML\n","\nNot so specialTodaythe guy I've been dating and sleeping with told me he is also dating another woman, but that they only kiss. I was under the impression we were exclusive for two months now, since I told him if we slept together that it would be. FML ","\nTodayI was working in the box office. A group came in for tickets but wanted to pay individually. One paid $40 for a $25 ticket. Laughing, I reached for the calculator while saying, I went to public school, so I can't do math.\" They didn't laugh. They were all teachers in public schools. FML\n","\nTodayI was so sleep-deprived, I thought a white car driving toward me was a polar bear. I screamed like a little girl and started panicking. I live in California. FML\n","\nTodayI got into an argument with a 7 year old. He said that Obama was the 44th President, I said he was the 42nd. Guess who was right. FML\n","\nTodayI had to give a deposition ahead of a trial in which my former boss is accused of fraud. I'm not a smart man, and I smoked a joint before heading out to try to calm my nerves. I got way too high and ended up giggling like an idiot through half the deposition. FML\n","\nTodayon the brink of a stiflingly hot summer, I've come to a terrible realisation. It seems the apartment I've just moved into has been specially insulated to trap enough heat inside for the occupants to survive the planet's next Ice Age. FML\n","\nTodayat the restaurant I work at, I gave a man back his change and told him to enjoy the sunny day. He replied by dramatically saying that the sun was his mortal enemy. Thinking he was joking, I asked him if he was a vampire. Turns out he has skin cancer. FML\n","\nTodayI was broken up with via a cereal analogy. Apparently, I'm a Cheerio and all he wants is a Froot Loop. FML\n"]
